[
  {
    "билет": "Сложный билет 1",
    "вопросы": [
      "Проанализируйте архитектуру домена Active Directory и объясните принципы взаимодействия контроллеров домена между собой.",
      "Объясните, как работают FSMO-роли, и приведите примеры, когда их перенос становится критически важным."
    ],
    "теория": "Active Directory использует многомастерную репликацию между контроллерами домена. Все контроллеры равноправны (кроме FSMO-ролей) и синхронизируют данные через протокол репликации. Каждый контроллер хранит копию базы данных AD.\nFSMO (Flexible Single Master Operations) — 5 уникальных ролей, выполняемых одним или несколькими контроллерами. При сбое сервера с ролями (например, RID Master или PDC Emulator), их нужно перенести вручную на другой сервер, иначе возможны сбои в создании пользователей, политик или синхронизации времени.",
    "практика": "Показать FSMO-роли:\npowershell\nnetdom query fsmo\n\nПеренос роли RID Master:\npowershell\nMove-ADDirectoryServerOperationMasterRole -Identity \"DC2\" -OperationMasterRole RIDMaster"
  },
  {
    "билет": "Сложный билет 2",
    "вопросы": [
      "Объясните механизм работы SELinux с точки зрения безопасности ядра и взаимодействия с DAC.",
      "Разберите ситуацию: SELinux мешает запуску Apache. Опишите шаги диагностики и устранения проблемы."
    ],
    "теория": "SELinux использует мандатный контроль доступа (MAC), встраиваясь в ядро. Он накладывает правила сверху DAC (обычных прав) и запрещает операции, даже если DAC разрешает, если контекст безопасности запрещает действие.\nПроверить статус SELinux, изучить логи через audit.log, использовать sealert или ausearch. Разрешить нужный доступ через setsebool или задать правильный контекст через restorecon или chcon.",
    "практика": "Проверка:\nbash\ngetenforce\n\nУстранение:\nbash\nsetsebool -P httpd_can_network_connect 1\nrestorecon -Rv /var/www/html"
  },
  {
    "билет": "Сложный билет 3",
    "вопросы": [
      "Опишите модель доверия в Active Directory. В чём разница между однонаправленным и двусторонним доверием?",
      "Разберите сценарий миграции между двумя лесами AD. Какие риски и меры безопасности необходимо учесть?"
    ],
    "теория": "Модель доверия определяет, какие домены могут аутентифицировать пользователей друг друга. Однонаправленное доверие — доступ в одну сторону. Двунаправленное — оба домена доверяют друг другу.\nРиски: потеря данных, конфликт SID, несоответствие политик. Меры: резервное копирование, проверка доверий, тестовая миграция, настройка SIDHistory, синхронизация времени.",
    "практика": "Создание доверия:\nAD Domains and Trusts → Trusts → New Trust → указать второй домен → выбрать двустороннее доверие."
  },
  {
    "билет": "Сложный билет 4",
    "вопросы": [
      "Как устроен механизм централизованного логирования в корпоративной инфраструктуре на базе syslog-ng или rsyslog?",
      "Объясните риски при передаче логов по незащищённым каналам и способы их защиты."
    ],
    "теория": "Syslog-ng и rsyslog собирают логи с клиентов и пересылают их на центральный сервер по TCP/UDP. Сервер фильтрует, сохраняет и обрабатывает логи.\nРиски: перехват логов, подмена. Защита: использование TLS/SSL для шифрования, VPN, аутентификация клиентов, контроль доступа к журналам.",
    "практика": "В /etc/rsyslog.conf сервера:\nbash\nmodule(load=\"imtcp\")\ninput(type=\"imtcp\" port=\"6514\")\n$DefaultNetstreamDriverCAFile /etc/pki/tls/certs/ca-bundle.crt"
  },
  {
    "билет": "Сложный билет 5",
    "вопросы": [
      "Проанализируйте различия между GPO и локальными политиками. Как GPO обрабатываются при конфликте между различными уровнями (OU, сайт, домен)?",
      "Как отследить и устранить проблему, если политика, применённая через GPO, не работает на клиенте?"
    ],
    "теория": "Локальные политики действуют только на конкретный компьютер. GPO применяются централизованно через AD. При конфликте приоритет: локальная < сайт < домен < OU. Ближайшая к объекту политика имеет наибольшую силу.\nИспользовать gpresult /h и инструмент RSOP (Resultant Set of Policy). Проверить порядок применения, наследование, блокировки и фильтры безопасности.",
    "практика": "cmd\ngpresult /h report.html\nили\nПуск → Выполнить → rsop.msc"
  },
  {
    "билет": "Сложный билет 6",
    "вопросы": [
      "Объясните архитектуру виртуальной сети Hyper-V: коммутаторы, изоляция, VLAN, маршрутизация.",
      "Как обеспечить безопасность виртуальных машин в сети с использованием изолированных виртуальных свитчей?"
    ],
    "теория": "Hyper-V использует виртуальные коммутаторы: внешний (в интернет), внутренний (между ВМ и хостом), частный (только между ВМ). VLAN позволяют изолировать трафик. Маршрутизация выполняется через NAT или IP-адресацию.\nПрименяются частные коммутаторы, VLAN-теги, настройки брандмауэров, ограничение MAC и IP, отключение ненужных сервисов и управление группами безопасности.",
    "практика": "Hyper-V Manager → Virtual Switch Manager →\nСоздайте Private и External Switch →\nНазначьте VLAN ID в свойствах ВМ."
  },
  {
    "билет": "Сложный билет 7",
    "вопросы": [
      "Что такое централизованная система управления обновлениями в Red OS? Сравните её с WSUS в Windows Server.",
      "Разберите риски, связанные с неконтролируемыми обновлениями в корпоративной инфраструктуре."
    ],
    "теория": "В Red OS используется локальный репозиторий или инструменты вроде Katello/Foreman.\nWSUS — сервер централизованной загрузки и распределения обновлений для Windows. Оба позволяют экономить трафик и контролировать обновления.\nРиски: сбои, несовместимости, уязвимости. Решения: тестирование обновлений, централизованный контроль, отложенное применение.",
    "практика": "На сервере:\nbash\ncreaterepo /var/www/html/repo/\n\nНа клиенте в /etc/yum.repos.d/local.repo:\nini\n[local]\nname=Local Repo\nbaseurl=http://server/repo/\nenabled=1\ngpgcheck=0"
  }
]
