[
  {
    "билет": "Сложный билет 1",
    "вопросы": [
      "Проанализируйте архитектуру домена Active Directory и объясните принципы взаимодействия контроллеров домена между собой.",
      "Объясните, как работают FSMO-роли, и приведите примеры, когда их перенос становится критически важным."
    ],
    "теория": "Active Directory использует многомастерную репликацию между контроллерами домена. Все контроллеры равноправны (кроме FSMO-ролей) и синхронизируют данные через протокол репликации. Каждый контроллер хранит копию базы данных AD.\nFSMO (Flexible Single Master Operations) — 5 уникальных ролей, выполняемых одним или несколькими контроллерами. При сбое сервера с ролями (например, RID Master или PDC Emulator), их нужно перенести вручную на другой сервер, иначе возможны сбои в создании пользователей, политик или синхронизации времени.",
    "практика": "Показать FSMO-роли: Используйте инструмент управления доменом для просмотра ролей. Для переноса роли RID Master используйте соответствующую функцию в оснастке Active Directory или команду переноса роли."
  },
  {
    "билет": "Сложный билет 2",
    "вопросы": [
      "Объясните механизм работы SELinux с точки зрения безопасности ядра и взаимодействия с DAC.",
      "Разберите ситуацию: SELinux мешает запуску Apache. Опишите шаги диагностики и устранения проблемы."
    ],
    "теория": "SELinux использует мандатный контроль доступа (MAC), встраиваясь в ядро. Он накладывает правила сверху DAC (обычных прав) и запрещает операции, даже если DAC разрешает, если контекст безопасности запрещает действие.\nПроверить статус SELinux, изучить логи через audit.log, использовать инструменты анализа. Разрешить нужный доступ через изменение настроек SELinux или корректировку контекста безопасности.",
    "практика": "Проверка: Определите статус SELinux через системные настройки. Для устранения проблем с доступом настройте необходимые параметры SELinux и восстановите правильные контексты для нужных директорий."
  },
  {
    "билет": "Сложный билет 3",
    "вопросы": [
      "Опишите модель доверия в Active Directory. В чём разница между однонаправленным и двусторонним доверием?",
      "Разберите сценарий миграции между двумя лесами AD. Какие риски и меры безопасности необходимо учесть?"
    ],
    "теория": "Модель доверия определяет, какие домены могут аутентифицировать пользователей друг друга. Однонаправленное доверие — доступ в одну сторону. Двунаправленное — оба домена доверяют друг другу.\nРиски: потеря данных, конфликт SID, несоответствие политик. Меры: резервное копирование, проверка доверий, тестовая миграция, настройка SIDHistory, синхронизация времени.",
    "практика": "Создание доверия: Используйте оснастку управления доменами и доверием для создания нового доверия между доменами, выберите тип доверия и следуйте мастеру настройки."
  },
  {
    "билет": "Сложный билет 4",
    "вопросы": [
      "Как устроен механизм централизованного логирования в корпоративной инфраструктуре на базе syslog-ng или rsyslog?",
      "Объясните риски при передаче логов по незащищённым каналам и способы их защиты."
    ],
    "теория": "Syslog-ng и rsyslog собирают логи с клиентов и пересылают их на центральный сервер по TCP/UDP. Сервер фильтрует, сохраняет и обрабатывает логи.\nРиски: перехват логов, подмена. Защита: использование TLS/SSL для шифрования, VPN, аутентификация клиентов, контроль доступа к журналам.",
    "практика": "Настройте сервер для приёма логов по защищённому каналу, укажите необходимые параметры для шифрования и авторизации клиентов."
  },
  {
    "билет": "Сложный билет 5",
    "вопросы": [
      "Проанализируйте различия между GPO и локальными политиками. Как GPO обрабатываются при конфликте между различными уровнями (OU, сайт, домен)?",
      "Как отследить и устранить проблему, если политика, применённая через GPO, не работает на клиенте?"
    ],
    "теория": "Локальные политики действуют только на конкретный компьютер. GPO применяются централизованно через AD. При конфликте приоритет: локальная < сайт < домен < OU. Ближайшая к объекту политика имеет наибольшую силу.\nИспользовать инструменты анализа политик для диагностики, проверить порядок применения, наследование, блокировки и фильтры безопасности.",
    "практика": "Для анализа применённых политик используйте инструменты просмотра результатов применения политик и отчёты."
  },
  {
    "билет": "Сложный билет 6",
    "вопросы": [
      "Объясните архитектуру виртуальной сети Hyper-V: коммутаторы, изоляция, VLAN, маршрутизация.",
      "Как обеспечить безопасность виртуальных машин в сети с использованием изолированных виртуальных свитчей?"
    ],
    "теория": "Hyper-V использует виртуальные коммутаторы: внешний (в интернет), внутренний (между ВМ и хостом), частный (только между ВМ). VLAN позволяют изолировать трафик. Маршрутизация выполняется через NAT или IP-адресацию.\nПрименяются частные коммутаторы, VLAN-теги, настройки брандмауэров, ограничение MAC и IP, отключение ненужных сервисов и управление группами безопасности.",
    "практика": "Используйте менеджер виртуальных коммутаторов для создания нужных типов свитчей и настройки VLAN. Назначьте соответствующие параметры безопасности для виртуальных машин."
  },
  {
    "билет": "Сложный билет 7",
    "вопросы": [
      "Что такое централизованная система управления обновлениями в Red OS? Сравните её с WSUS в Windows Server.",
      "Разберите риски, связанные с неконтролируемыми обновлениями в корпоративной инфраструктуре."
    ],
    "теория": "В Red OS используется локальный репозиторий или инструменты вроде Katello/Foreman.\nWSUS — сервер централизованной загрузки и распределения обновлений для Windows. Оба позволяют экономить трафик и контролировать обновления.\nРиски: сбои, несовместимости, уязвимости. Решения: тестирование обновлений, централизованный контроль, отложенное применение.",
    "практика": "Настройте локальный репозиторий на сервере и пропишите параметры подключения к нему на клиентах. Проверьте, что обновления устанавливаются только из доверенного источника."
  }
]
