[
  {
    "билет": 1,
    "практика": "Создание пользователя в AD с обязательной сменой пароля",
    "инструкция": "GUI: Откройте ADUC. Нажмите Win + R, введите dsa.msc и нажмите Enter. В левой панели разверните домен и найдите подразделение, где нужно создать пользователя. Правый клик по OU, выберите Создать → Пользователь. В мастере создания заполните имя, фамилию, логин. Нажмите Далее. Введите временный пароль в оба поля. Снимите галочку Пользователь должен изменить пароль при следующем входе (это временно). Нажмите Далее и Готово. Двойной клик по созданному пользователю, вкладка Учетная запись. В разделе Параметры пароля установите Пользователь должен изменить пароль при следующем входе. Нажмите Применить и ОК. Проверка: В списке пользователей появится новый пользователь. При входе под этим пользователем система потребует сменить пароль."
  },
  {
    "билет": 2,
    "практика": "Добавление ПК в домен",
    "инструкция": "На клиентском ПК откройте свойства системы. В разделе имя компьютера, домен и параметры рабочей группы нажмите Изменить. В окне выберите Домен и введите имя домена. Нажмите ОК и введите учетные данные администратора домена. Если подключение успешно, появится сообщение о вступлении в домен. Перезагрузите ПК. При входе выберите пользователя из домена. Проверка: В ADUC появится новый объект с именем ПК."
  },
  {
    "билет": 3,
    "практика": "Назначение роли FSMO",
    "инструкция": "GUI: Откройте ADUC, правый клик по домену, выберите Operations Masters. Вкладка RID (или другие роли: PDC, Infrastructure) выберите контроллер домена из списка Current Operations Master, нажмите Change. Подтвердите перенос роли, нажмите ОК. PowerShell: Используйте команду Move-ADDirectoryServerOperationMasterRole -Identity <Имя_КД> -OperationMasterRole RidMaster, заменив <Имя_КД> на имя контроллера домена. Проверка: Выполните netdom query fsmo, в выводе будет указан новый владелец роли."
  },
  {
    "билет": 4,
    "практика": "Создание OU и перемещение пользователя",
    "инструкция": "Создайте OU в ADUC, правый клик по домену, выберите Создать → Organizational Unit, введите имя. Нажмите ОК. Переместите пользователя, найдите пользователя в списке, перетащите его в OU, или правый клик по пользователю, выберите Переместить, выберите OU. Проверка: В ADUC разверните OU, пользователь отобразится внутри."
  },
  {
    "билет": 5,
    "практика": "Настройка GPO, запрещающей панель управления",
    "инструкция": "Откройте GPMC, создайте GPO в домене, правый клик по OU, где нужно применить GPO, выберите Создать GPO в этом домене и связать его, введите имя. Настройте GPO: правый клик по созданному GPO, выберите Изменить, перейдите в User Configuration → Administrative Templates → Control Panel → Prohibit access to Control Panel and PC settings, двойной клик, выберите Enabled, нажмите ОК. GPO автоматически связан с OU. Проверка: На клиентском ПК войдите под пользователем, попробуйте открыть Панель управления, должно появиться сообщение о запрете."
  },
  {
    "билет": 6,
    "практика": "Установка DHCP и настройка диапазона",
    "инструкция": "Установите роль DHCP через Server Manager, добавив DHCP-сервер на шаге Роли сервера. Запустите мастер настройки DHCP, выберите Создать область, укажите имя, задайте диапазон IP-адресов и маску подсети. Пропустите настройку исключений, укажите срок аренды, завершите мастер. Активируйте область в консоли DHCP, правый клик по созданной области, выберите Активировать. Проверка: Клиентский ПК, подключенный к сети, должен получить IP из заданного диапазона."
  },
  {
    "билет": 7,
    "практика": "Настройка DNS, создание A-записи",
    "инструкция": "Установите роль DNS через Server Manager, добавив DNS-сервер. Создайте зону прямого просмотра в DNS Manager, выбрав Основная зона, укажите имя зоны и завершите мастер. Добавьте A-запись, указав имя хоста и IP-адрес. Проверка: Выполните nslookup для проверки разрешения имени хоста на IP-адрес."
  },
  {
    "билет": 8,
    "практика": "Создание общей папки с доступом для группы",
    "инструкция": "Создайте папку на сервере, например, C:\\Shared. Включите общий доступ к папке через свойства папки, отметив Включить общий доступ к этой папке. Настройте разрешения NTFS, добавив группу и установив для нее полный доступ. Проверка: На клиентском ПК введите в проводнике \\[Имя_сервера]\\Shared, должен запросить учетные данные и открыть папку."
  },
  {
    "билет": 9,
    "практика": "Настройка chronyd (Red OS)",
    "инструкция": "Установите chrony через пакетный менеджер. Настройте источник времени, отредактировав файл конфигурации и указав надежный NTP-сервер. Перезапустите службу chronyd. Проверка: Выполните chronyc sources, должен отобразиться подключенный NTP-сервер."
  },
  {
    "билет": 10,
    "практика": "Настройка резервного копирования",
    "инструкция": "Откройте консоль резервного копирования через Server Manager. Создайте план бэкапа, выбрав Системный том и указав путь для сохранения. Проверка: План появится в списке задач, можно запустить тестовое копирование."
  },
  {
    "билет": 11,
    "практика": "Установка роли файлового сервера",
    "инструкция": "Установите роль файлового сервера через Server Manager. Проверка: В Server Manager в разделе Роли появится Файловый сервер."
  },
  {
    "билет": 12,
    "практика": "Настройка GPO для паролей",
    "инструкция": "Откройте GPMC, выберите GPO домена, правый клик по GPO, выберите Изменить. Перейдите в Computer Configuration → Policies → Windows Settings → Security Settings → Account Policies → Password Policy. Двойной клик по Minimum password length, установите значение, нажмите ОК. Проверка: На клиенте при создании пользователя пароль должен соответствовать длине."
  },
  {
    "билет": 13,
    "практика": "Включение аудита неудачных входов",
    "инструкция": "Откройте Local Security Policy, разверните Local Policies → Audit Policy. Двойной клик по Audit logon events, выберите Аудит неудачных попыток, нажмите ОК. Проверка: После неудачного входа проверьте журнал событий, должны появиться события с ID 4625."
  },
  {
    "билет": 14,
    "практика": "Настройка NAT через iptables (Red OS)",
    "инструкция": "Включите перенаправление IP, добавив строку в sysctl.conf и перезапустив систему. Добавьте правило NAT, указав внешний интерфейс. Сохраните правила iptables. Проверка: С клиента из внутренней сети попробуйте выйти в интернет — должно работать."
  },
  {
    "билет": 15,
    "практика": "Установка Squid (Red OS)",
    "инструкция": "Установите Squid через пакетный менеджер. Настройте базовый доступ, изменив конфигурационный файл. Запустите и включите Squid при загрузке. Проверка: На клиенте настройте прокси, браузер должен открывать сайты."
  },
  {
    "билет": 16,
    "практика": "Добавление записи в /etc/hosts (Red OS)",
    "инструкция": "Откройте файл hosts, добавьте строку с IP и FQDN сервера. Сохраните файл. Проверка: Выполните ping для проверки разрешения имени на IP-адрес."
  },
  {
    "билет": 17,
    "практика": "Создание RAID 1 через mdadm (Red OS)",
    "инструкция": "Инициализируйте диски, убедившись в их наличии. Создайте RAID 1, указав диски в команде mdadm. Создайте файловую систему на RAID-массиве. Смонтируйте RAID в систему. Проверка: Выполните cat /proc/mdstat, должен отобразиться статус RAID 1."
  },
  {
    "билет": 18,
    "практика": "Отображение FSMO-ролей (Windows Server)",
    "инструкция": "Откройте командную строку, выполните команду для отображения ролей. Проверка: В выводе будет список ролей и их владельцев."
  },
  {
    "билет": 19,
    "практика": "Разрешение RDP (Windows Server)",
    "инструкция": "Откройте свойства системы, перейдите на вкладку Удаленный доступ. Выберите Разрешить подключения от компьютеров с любой версией Remote Desktop. Нажмите ОК. Проверка: На клиенте используйте mstsc для подключения к серверу."
  },
  {
    "билет": 20,
    "практика": "Создание пользователя через PowerShell",
    "инструкция": "Откройте PowerShell от имени администратора, выполните команду для создания пользователя. Проверка: Выполните Get-ADUser для проверки создания пользователя."
  },
  {
    "билет": 21,
    "практика": "Настройка подключения к LDAP (Windows Server)",
    "инструкция": "Установите LDAP-клиент, выполните команду для установки. Выполните запрос к LDAP-серверу, указав хост, учетные данные и базу поиска. Проверка: Должен отобразиться список объектов AD."
  },
  {
    "билет": 22,
    "практика": "Создание ВМ в Hyper-V (Windows Server)",
    "инструкция": "Откройте Hyper-V Manager, создайте новую виртуальную машину, указав имя, путь для хранения, объем памяти и параметры жесткого диска. Укажите путь к ISO-образу Windows 10. Запустите ВМ и установите ОС. Проверка: ВМ отобразится в списке Hyper-V Manager, можно подключиться и увидеть процесс установки."
  },
  {
    "билет": 23,
    "практика": "Настройка SNMP (Red OS)",
    "инструкция": "Установите SNMP-агент через пакетный менеджер. Настройте community в конфигурационном файле, добавив строку для разрешения чтения с подсети. Запустите и включите службу SNMP. Проверка: На сервере мониторинга выполните команду для запроса данных, должны отобразиться данные."
  },
  {
    "билет": 24,
    "практика": "Блокировка порта 22 (Red OS)",
    "инструкция": "Добавьте правило iptables для блокировки порта 22. Сохраните правила iptables. Проверка: Попробуйте подключиться по SSH, должно быть отказано."
  },
  {
    "билет": 25,
    "практика": "Поиск неудачных входов (Windows Server)",
    "инструкция": "Откройте Event Viewer, разверните Windows Logs → Security. Нажмите Фильтр текущего журнала, введите ID события 4625. Проверка: Появятся события с описанием неудачных входов."
  },
  {
    "билет": 26,
    "практика": "Установка OpenVPN (Red OS)",
    "инструкция": "Установите OpenVPN через пакетный менеджер. Скопируйте пример конфигурации сервера. Настройте конфиг, указав протокол, подсеть для клиентов и пути к сертификатам. Запустите и включите службу OpenVPN. Проверка: На клиенте настройте подключение с теми же сертификатами, должно установиться VPN."
  },
  {
    "билет": 27,
    "практика": "Настройка конфликта GPO (Windows Server)",
    "инструкция": "Создайте два GPO: один для запрета панели управления, другой для разрешения. Свяжите GPO с одним OU. Проверьте порядок применения на клиенте, выполнив команду для отображения примененных GPO."
  },
  {
    "билет": 28,
    "практика": "Установка vsftpd (Red OS)",
    "инструкция": "Установите vsftpd через пакетный менеджер. Настройте базовый доступ, изменив конфигурационный файл. Запустите и включите службу vsftpd. Проверка: На клиенте подключитесь через FTP-клиент, используйте логин/пароль локального пользователя."
  },
  {
    "билет": 29,
    "практика": "Установка WSUS (Windows Server)",
    "инструкция": "Установите роль WSUS через Server Manager. Запустите мастер настройки WSUS, укажите каталог для хранения обновлений. Синхронизируйте обновления через консоль WSUS. Проверка: В разделе Updates отобразятся доступные обновления."
  },
  {
    "билет": 30,
    "практика": "Проверка тикетов Kerberos (Windows Server)",
    "инструкция": "Откройте командную строку, выполните команду для отображения тикетов. Проверка: В выводе будет список тикетов Kerberos."
  },
  {
    "билет": 31,
    "практика": "Запрет входа в выходные дни (Windows Server)",
    "инструкция": "Создайте GPO, настройте ограничение по времени, запретив вход в выходные дни. Проверьте настройку, попытавшись войти под пользователем в выходные."
  },
  {
    "билет": 32,
    "практика": "Настройка хранения логов в journalctl (Red OS)",
    "инструкция": "Откройте конфиг journald, измените настройку хранения на persistent. Перезапустите journald. Проверка: Логи сохраняются после перезагрузки в /var/log/journal."
  },
  {
    "билет": 33,
    "практика": "Проверка SELinux и переключение в Permissive (Red OS)",
    "инструкция": "Проверьте статус SELinux, выполнив команду sestatus. Переключите в Permissive, выполнив команду setenforce 0. Для постоянного изменения отредактируйте конфиг SELinux. Проверка: sestatus, должен показать permissive режим."
  },
  {
    "билет": 34,
    "практика": "Проверка Netlogon (Windows Server)",
    "инструкция": "Откройте командную строку, выполните команду nltest для проверки доверия к домену. Проверка: В выводе будет информация о доверии к домену."
  },
  {
    "билет": 35,
    "практика": "Настройка запрета USB через GPO (Windows Server)",
    "инструкция": "Создайте GPO, настройте запрет доступа ко всем съемным носителям. Свяжите GPO с OU. Проверка: Подключите USB-накопитель к клиенту, он не должен определяться."
  },
  {
    "билет": 36,
    "практика": "Добавление пользователя в группу «Администраторы домена» (Windows Server)",
    "инструкция": "Откройте ADUC, найдите пользователя, двойной клик. Вкладка Член групп, нажмите Добавить, введите Администраторы домена, выберите группу, нажмите ОК. Проверка: В свойствах пользователя должна отображаться группа Администраторы домена."
  },
  {
    "билет": 37,
    "практика": "Настройка логирования sudo (Red OS)",
    "инструкция": "Откройте файл sudoers, добавьте строку для логирования в конец файла. Создайте файл логов, установите для него правильные права. Проверка: Выполните sudo команду, проверьте файл логов."
  },
  {
    "билет": 38,
    "практика": "Настройка статического IP (Red OS)",
    "инструкция": "Откройте конфиг интерфейса, измените настройки на статические. Перезапустите сетевую службу. Проверка: Выполните ip a, у интерфейса должен быть указанный статический IP."
  },
  {
    "билет": 39,
    "практика": "Создание задания cron (Red OS)",
    "инструкция": "Откройте редактор crontab, добавьте строку для задания. Сохраните и выйдите. Проверка: Проверьте расписание через crontab -l, задание должно отображаться."
  },
  {
    "билет": 40,
    "практика": "Настройка доступа через setfacl (Red OS)",
    "инструкция": "Создайте пользователя и папку, установите ACL для пользователя на папку. Проверьте ACL. Проверка: Пользователь должен иметь доступ к папке согласно установленным разрешениям."
  },
  {
    "билет": 41,
    "практика": "Установка WINS (Windows Server)",
    "инструкция": "Установите роль WINS через Server Manager. Добавьте статическую запись в WINS Manager. Проверка: В списке статических записей должна появиться новая запись."
  },
  {
    "билет": 42,
    "практика": "Проверка репликации (Windows Server)",
    "инструкция": "Откройте командную строку, выполните команду для проверки репликации. Проверка: В выводе будет статистика репликации между контроллерами домена."
  },
  {
    "билет": 43,
    "практика": "Создание LVM (Red OS)",
    "инструкция": "Создайте физический том, группу томов и логический том с заданными параметрами. Проверка: Выполните lvdisplay, должен отобразиться созданный логический том."
  },
  {
    "билет": 44,
    "практика": "Проверка sshd (Red OS)",
    "инструкция": "Проверьте статус sshd, выполните команду systemctl status sshd. Включите sshd при загрузке, выполните команду systemctl enable sshd. Проверка: Статус sshd должен быть active (running)."
  },
  {
    "билет": 45,
    "практика": "Отображение схемы AD (Windows Server)",
    "инструкция": "Запустите ADSIEdit, перейдите в раздел Schema. Проверка: Должен отобразиться список классов и атрибутов схемы AD."
  },
  {
    "билет": 46,
    "практика": "Настройка общего принтера (Windows Server)",
    "инструкция": "Установите драйвер принтера, откройте свойства принтера. Настройте общий доступ, отметив Share this printer. Предоставьте доступ группе, добавив группу в вкладке Security. Проверка: На клиенте добавьте сетевой принтер, должен установиться."
  },
  {
    "билет": 47,
    "практика": "Создание задания в Task Scheduler (Windows Server)",
    "инструкция": "Откройте Task Scheduler, создайте простую задачу. Укажите имя, настройте триггер и действие. Завершите мастер. Проверка: Задание должно появиться в списке задач."
  },
  {
    "билет": 48,
    "практика": "Настройка отправки логов на syslog-сервер (Red OS)",
    "инструкция": "На клиенте откройте конфиг rsyslog, добавьте строку для отправки логов на syslog-сервер. Перезапустите rsyslog. На сервере настройте прием логов, отредактировав конфиг rsyslog. Перезапустите rsyslog. Проверка: На сервере проверьте /var/log/messages, должны появляться логи с клиента."
  },
  {
    "билет": 49,
    "практика": "Установка freeradius (Red OS)",
    "инструкция": "Установите freeradius через пакетный менеджер. Запустите тестовый режим, выполните команду для запуска freeradius в тестовом режиме. Проверка: В выводе должны отображаться подключения тестового клиента."
  },
  {
    "билет": 50,
    "практика": "Настройка блокировки через GPO (Windows Server)",
    "инструкция": "Создайте GPO, настройте блокировку учетной записи после нескольких неудачных попыток входа. Свяжите GPO с OU. Проверка: Введите неверный пароль несколько раз, учетная запись должна заблокироваться."
  }
]
